Table of Contents
 Class CrossSectionFactoryHelper
Namespace
IdeaStatiCa.BimApiLink.Utils
Assembly
IdeaStatiCa.BimApiLink.dll
CrossSectionFactoryHelper
public static class CrossSectionFactoryHelper
Inheritance
object
CrossSectionFactoryHelper
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 FillBox2(IdeaCrossSectionByParameters, double, double, double, double, double, double, double)
Box 2 - steel shape
public static void FillBox2(IdeaCrossSectionByParameters css, double bu, double bb, double hw, double b1, double tw, double tfu, double tfb)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
bu double
Width of upper flange
bb double
Width of bottom flange
hw double
Height of web
b1 double
Web distance
tw double
Web thickness
tfu double
Upper flange thickness
tfb double
Bottom flange thickness
 FillCircle(IdeaCrossSectionByParameters, double)
Circular shape - for steel or concrete shape
public static void FillCircle(IdeaCrossSectionByParameters css, double d)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
d double
Diametrer of the shape
 FillColdFormedC(IdeaCrossSectionByParameters, double, double, double, double, double, bool)
Fill parameters for cold formed C section
public static void FillColdFormedC(IdeaCrossSectionByParameters css, double Width, double Height, double Thickness, double Radius, double lip, bool mirrorZ = false)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
Width double
Css width
Height double
Height of cross-section
Thickness double
Thickness
Radius double
Inside radius
lip double
Lip length
mirrorZ bool
 FillColdFormedZ(IdeaCrossSectionByParameters, double, double, double, double, bool)
Fill parameters for cold formed Z section
public static void FillColdFormedZ(IdeaCrossSectionByParameters css, double width, double height, double thickness, double radius, bool mirrorZ)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
width double
Css width
height double
Height of cross-section
thickness double
Thickness
radius double
Inside radius
mirrorZ bool
Mirrored shape
 FillRectangle(IdeaCrossSectionByParameters, double, double)
Rectangle shape - massive concrete shape
public static void FillRectangle(IdeaCrossSectionByParameters css, double width, double height)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
width double
Width of the rectangle
height double
Height of the rectangle
 FillRolledAngle(IdeaCrossSectionByParameters, double, double, double, double, double, double, bool, bool)
Rolled steel angle
public static void FillRolledAngle(IdeaCrossSectionByParameters css, double B, double D, double t, double rw, double r2, double C, bool mirrorZ = false, bool mirrorY = false)
Parameters
css IdeaCrossSectionByParameters
CrossSectionParameter to fill
B double
Width
D double
Depth
t double
Thickness
rw double
Root radius
r2 double
Toe radius
C double
Centroid position
mirrorZ bool
Z-axis mirror
mirrorY bool
Y-axis mirror
 FillRolledCHS(IdeaCrossSectionByParameters, double, double)
Steel circular hollow section
public static void FillRolledCHS(IdeaCrossSectionByParameters css, double r, double t)
Parameters
css IdeaCrossSectionByParameters
CrossSectionParameter to fill
r double
Radius
t double
Thickness
 FillRolledChannel(IdeaCrossSectionByParameters, double, double, double, double, double, double, double, bool)
Rolled steel channel
public static void FillRolledChannel(IdeaCrossSectionByParameters css, double B, double D, double tw, double tf, double rw, double rf, double taperF, bool mirrorZ = false)
Parameters
css IdeaCrossSectionByParameters
CrossSectionParameter to fill
B double
Width
D double
Depth
tw double
Web thickness
tf double
Flange thickness
rw double
Root radius
rf double
Flange edge radius
taperF double
Flange taper
mirrorZ bool
 FillRolledI(IdeaCrossSectionByParameters, double, double, double, double, double, double, double)
Rolled steel I section
public static void FillRolledI(IdeaCrossSectionByParameters css, double b, double h, double s, double t, double r2, double tapperF, double r1)
Parameters
css IdeaCrossSectionByParameters
IdeaCrossSectionByParameters to fill
b double
Width
h double
Height
s double
Web thickness
t double
Flange thickness
r2 double
Inside radius
tapperF double
Flange tapper
r1 double
Flange edge rounding radius
 FillRolledRHS(IdeaCrossSectionByParameters, double, double, double, double, double, double)
Steel rectangular hollow section
public static void FillRolledRHS(IdeaCrossSectionByParameters css, double D, double B, double t, double r1, double r2, double d)
Parameters
css IdeaCrossSectionByParameters
CrossSectionParameter to fill
D double
depth
B double
width
t double
thickness
r1 double
inner radius
r2 double
outer radius
d double
web buckling depth
 FillRolledT(IdeaCrossSectionByParameters, double, double, double, double, double, double, double, double, double, bool)
Rolled steel T section
public static void FillRolledT(IdeaCrossSectionByParameters css, double B, double H, double Tw, double Tf, double R, double R1, double R2, double tapperF, double tapperW, bool mirrorY = false)
Parameters
css IdeaCrossSectionByParameters
CrossSectionParameter to fill
B double
Width
H double
Height
Tw double
Web thickness
Tf double
Flange thickness
R double
Inside radius
R1 double
Flange edge rounding radius
R2 double
Web edge rounding radius
tapperF double
Flange tapper
tapperW double
Web tapper
mirrorY bool
Y-axis mirror
 FillWeldedAsymI(IdeaCrossSectionByParameters, double, double, double, double, double, double)
Welded I asymetrical - steel shape
public static void FillWeldedAsymI(IdeaCrossSectionByParameters css, double bu, double bb, double hw, double tw, double tfu, double tfb)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
bu double
Width of upper flange
bb double
Width of bottom flange
hw double
Height of web
tw double
Web thickness
tfu double
Upper flange thickness
tfb double
Bottom flange thickness
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bu = 0.150;
double bb = 0.180;
double hw = 0.320;
double tw = 0.016;
double tfu = 0.014;
double tfb = 0.018;
CrossSectionFactory.FillWeldedAsymI(css, bu, bb, hw, tw, tfu, tfb);
openStructModel.AddObject(css);
Remarks
Dimension of assymetrical I section
 FillWeldedI(IdeaCrossSectionByParameters, double, double, double, double)
Fill steel section of welded I
public static void FillWeldedI(IdeaCrossSectionByParameters css, double bu, double hw, double tw, double tf)
Parameters
css IdeaCrossSectionByParameters
Parameters of CrossSectionParameter will be filled
bu double
Width of flange
hw double
Height of web
tw double
Web thickness
tf double
Flange thickness
Examples
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 1;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());  // I have only one material, I take the first one
double bu = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf = 0.02;
CrossSectionFactory.FillWeldedI(css, bu, hw, tw, tf);
openStructModel.AddObject(css);
Remarks
Dimension of welded I section
 Edit this page